app/controllers/categories_controller.rb

INSERT INTO `categories` (`category_name`, `description`, `created_at`, `updated_at`) VALUES ('Food', 'Delicious mouth watering starts here', '2015-09-25 05:03:31', '2015-09-25 05:03:31')
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE `categories` SET `description` = 'Cover Yourself, and be trendy. Show the world you are awesome', `updated_at` = '2015-09-25 06:49:34' WHERE `categories`.`id` = 1
---
  def update
    respond_to do |format|
      if @category.update(category_params)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
    def set_category
      @category = Category.find(params[:id])