app/controllers/customers_controller.rb

SELECT  `customers`.* FROM `customers` WHERE `customers`.`deleted_at` IS NULL LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `customers`
---
  def index
    @customers = Customer.paginate(page: params[:page], :per_page => 10)

INSERT INTO `customers` (`first_name`, `last_name`, `email`, `mobile`, `address`, `country`, `city`, `pincode`, `password_digest`, `date_of_birth`, `created_at`, `updated_at`) VALUES ('Chetan', 'K S', 'chetan@email.com', 8951329997, 'India layout', 'IND', 'mys', 560048, '$2a$10$LmN3t.RbyXqiPs04Fy9Zs.Z2csOa8y6UhFjGzenenub3qr3WZBTba', '1992-06-25', '2015-09-23 07:13:47', '2015-09-23 07:13:47')
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE `customers` SET `address` = 'Shetty Layout, Garudacharapalya', `password_digest` = '$2a$10$/whAAuLCPPaUCdzMUKcXD.MGSRF5i3bmFUHx7VvWm7clWUEPQA1S6', `updated_at` = '2015-09-23 09:09:23' WHERE `customers`.`id` = 1
---
  def update
    respond_to do |format|
      if @customer.update_attributes(customer_params)

DELETE FROM `customers` WHERE `customers`.`id` = 3
---
  def destroy
    @customer.destroy

SELECT  `customers`.* FROM `customers` WHERE `customers`.`deleted_at` IS NULL AND `customers`.`id` = 1 LIMIT 1
---
    def set_customer
      @customer = Customer.find(params[:id])