app/controllers/products_controller.rb

  def index
    @products = Product.paginate(page: params[:page], :per_page => 10)
---
SELECT  `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `products`

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`product_name`, `brand`, `description`, `price`, `quantity`, `category_id`, `created_at`, `updated_at`) VALUES ('Reebok T-Shirt', 'Reebok', 'Slim fit, and adds on more to your style when you hang around wearing it.', 850, 45, 1, '2015-09-25 09:51:29', '2015-09-25 09:51:29')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `image_file_name` = 'toaster_black.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 161796, `image_updated_at` = '2015-09-25 09:42:26', `updated_at` = '2015-09-25 09:42:26' WHERE `products`.`id` = 1

  def destroy
    @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 1

    def set_product
      @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL AND `products`.`id` = 3 LIMIT 1

    def set_categories
      @categories = Category.order(:category_name)
---
SELECT `categories`.* FROM `categories`  ORDER BY `categories`.`category_name` ASC