app/controllers/sessions_controller.rb

SELECT  `customers`.* FROM `customers` WHERE `customers`.`deleted_at` IS NULL AND `customers`.`email` = 'chetan@email.com' LIMIT 1
---
  def create
    customer = Customer.find_by(email: params[:session][:email].downcase)