app/controllers/store_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL  ORDER BY `products`.`product_name` ASC
---
  def index
    @products = Product.order(:product_name)

SELECT  `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL AND `products`.`id` = 5 LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL  ORDER BY `products`.`product_name` ASC
---
  def search_results
    @products = Product.where("product_name LIKE '%#{params[:search_key]}%'")